//List2-6 21の箇所を、少数部を持つ実数値をxとyに代入するように変更して、その結果を考察せよ
//考察 xとyがint型で定義されているため、整数値しか代入することができない。
//　　 そのようなxに63.1という小数を代入を行っているのでコンパイルを行うことができない。
//    コンパイルするためにはxとyの定義を変える必要がある

package chap2_1;

public class E02_01 {

	public static void main(String[] args) {
		// 問題文の通りxを定義する
		int x;
		// 問題文の通りyを定義する
		int y;
		//少数にする エラーのためコメントアウト
		//x = 63.1;
		//少数にする　エラーのためコメントアウト
		//y = 18.2;
		//xの値を出力する　エラーのためコメントアウト
		//System.out.println("xの値は" + x + "です。");
		//yの値を出力する　エラーのためコメントアウト
		//System.out.println("yの値は" + y + "です。");

	}

}